Repository: advocatux/planarity
Catalog: po/*.po
Languages: ca, de

source: Untangle the graph: Drag the vertices to get rid of crossed lines. All graphs can be completely untangled, but it may take some time!
ca: Desemboliqueu el dibuix: arrossegueu els vèrtexs fins que no es creui cap línia. Tots els dibuixos es poden desenredar per complet encara que podríeu necessitar bastant de temps.
de: Entwirre den Graphen: Verschieb die Kugeln, um all Überschneidungen loszuwerden. Alle Graphen sind komplett lösbar, aber es braucht manchmal Zeit!

source: Vertices may be dragged individually, or you can draw a lasso around vertices to be moved together. Two finger gestures pan and zoom the graph.
ca: Els vèrtexs es poden arrossegar individualment, o en podeu dibuixar un llaç al seu voltant moure'ls junts. Amplieu, reduïu i moveu el dibuix fent gestos amb dos dits.
de: Kugeln können einzeln verschoben werden oder gemeinsam, indem man vorher ein Lasso um sie zieht. Mit zwei Fingern kann man die Ansicht verschieben und vergrößern.

source: If your efforts have made things worse, use the reset button in the upper left to move things back to the start. The shuffle button will generate a new puzzle.
ca: Si amb els vostres esforços només heu empitjorat les coses, utilitzeu el botó de restabliment a la part superior esquerra per tornar-ho a posar tot com al principi. El botó de mescla generarà un nou trencaclosques.
de: Falls die bisherigen Anstrengungen alles nur schlimmer gemacht habe, kann man die Zurücksetzen-Schaltfläche oben links nutzen und von vorne beginnen. Die Mischen-Schaltfläche erzeugt eine neue Aufgabe.

source: The difficulty of the puzzle can be adjusted with the control in the upper right. Note that the number of vertices scales with the square of the difficulty, so things get complicated quickly!
ca: La dificultat del trencaclosques es pot ajustar amb els controls de la part superior dreta. Tingueu en compte que l'augment de vèrtexs escala exponencialment la dificultat, així que les coses es compliquen ràpidament.
de: Der Schwierigkeitsgrad der Aufgabe kann mit dem Regler rechts oben angepasst werden. Die Anzahl der Kugeln steigt mit dem Schwierigkeitsgrad. Die Sache wird so schnell kniffelig!

source: Original Flash game by %1.
ca: Joc original en Flash per en %1.
de: Originales Flash-Spiel von %1.

source: Based on gPlanarity by %1.
ca: Basat en gPlanarity per en %1.
de: Basiert auf gPlanarity von %1.

source: This implentation &copy; 2015 by Robert Schroll and released under the GPL.
ca: Aquesta implementació té &copy; 2015 den Robert Schroll i està publicada sota llicència GPL.
de: Diese Implementierung &copy; 2015 by Robert Schroll und veröffentlicht unter der GPL.

source: Now maintained &copy; 2018 by Michele Castellazzi.
ca: Manteniment actual &copy; 2018 per en Michele Castellazzi.
de: Aktuelle Pflege &copy; 2018 by Michele Castellazzi.

source: %1 intersection
ca: %1 intersecció
de: %1 Überschneidung

source: Difficulty
ca: Dificultat
de: Schwierigkeitsgrad

source: Play
ca: Jugueu
de: Spielen
